tutorials/cases/microTGA/0/Df
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (6e+10 0 0 0 6e+10 0 0 0 6e+10);

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    wall
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
}


// ************************************************************************* //
