tutorials/cases/microTGA/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            uniformFixedValue;
        uniformValue    table;
        uniformValueCoeffs
        {
            values          
2
(
(0 300)
(4000 966)
)
;
        }
        value           uniform 300;
    }
    wall
    {
        type            uniformFixedValue;
        uniformValue    table;
        uniformValueCoeffs
        {
            values          
2
(
(0 300)
(4000 966)
)
;
        }
        value           uniform 300;
    }
}


// ************************************************************************* //
